app/views/tags/show.html.erb

SELECT "photos".* FROM "photos" INNER JOIN "photos_tags" ON "photos"."id" = "photos_tags"."photo_id" WHERE "photos_tags"."tag_id" = $1  [["tag_id", 2]]
---
<div class='row'>
  <% @tag.photos.each do |photo| %>