app/views/photos/_photo.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."photo_id" = 1 LIMIT 1
---
  <div class="like-section" data-id="<%= photo.id %>">
    <% photo.likes.each do |like | %>