app/controllers/charges_controller.rb

	def index
		@charges = Charge.all
---
SELECT "charges".* FROM "charges"