app/controllers/charges_controller.rb

SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", "1"]]
---
	def new
		@photo = Photo.find(params[:id])

SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", "2"]]
INSERT INTO "orders" ("description", "photo_id", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["description", "Photo print"], ["photo_id", 3], ["user_id", 2]]
---
	def create
	  # Amount in cents
	  @amount = 500

	  @photo = Photo.find(params[:photo_id])

	  customer = Stripe::Customer.create(
	    :email => 'current_user.email',
	    :card  => params[:stripeToken]
	  )

	  charge = Stripe::Charge.create(
	    :customer    => customer.id,
	    :amount      => @amount,
	    :description => 'Rails Stripe customer',
	    :currency    => 'gbp'
	  )

	  Order.create(description: 'Photo print', user: current_user, photo: @photo)