app/controllers/likes_controller.rb

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."photo_id" = 8 ORDER BY "likes"."id" ASC LIMIT 1  [["user_id", 2]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."photo_id" = 1  [["user_id", 2]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 18]]
INSERT INTO "likes" ("created_at", "photo_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 29 Nov 2013 16:43:47 UTC +00:00], ["photo_id", 1], ["updated_at", Fri, 29 Nov 2013 16:43:47 UTC +00:00], ["user_id", 1]]
---
	def create

		if current_user.likes.where(photo_id: params[:photo_id]).any?
			current_user.likes.find_by(photo_id: params[:photo_id]).destroy
			destroyed = true
		else
 	  	@like = Like.create(photo_id: params[:photo_id], user: current_user)