app/controllers/photos_controller.rb

INSERT INTO "photos" ("caption", "pic_content_type", "pic_file_name", "pic_file_size", "pic_updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["caption", "waaahhhhhh"], ["pic_content_type", "image/jpeg"], ["pic_file_name", "peas.jpg"], ["pic_file_size", 743966], ["pic_updated_at", Tue, 26 Nov 2013 18:23:33 UTC +00:00], ["user_id", 1]]
---
	def create
		#raise params.inspect
		@photo = current_user.photos.build(params[:photo].permit(:caption, :pic, :tag_names, :location))

    if @photo.save