app/controllers/tags_controller.rb

  def new
    @tag = Tag.new
    @photo = Photo.find(params[:photo_id])
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @photo = Photo.find(params[:photo_id])

    @tag = params[:tag]
    begin
      Tag.create_tags_for! @tag["tag_names"], @photo
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "tags" ("content", "created_at", "slug", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "zoo"], ["created_at", Fri, 29 Nov 2013 11:19:56 UTC +00:00], ["slug", "zoo"], ["updated_at", Fri, 29 Nov 2013 11:19:56 UTC +00:00]]

  def destroy
    @tag.destroy
---
DELETE FROM "tags" WHERE "tags"."id" = $1  [["id", 8]]