app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags" WHERE "tags"."slug" = '29' LIMIT 1
---
  def show
    # @tag = Tag.find(params[:id])
    @tag = Tag.find_by slug: params[:id]